In [70]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [71]:
# id = db.Column("room_id", db.Integer, primary_key=True)
#     room = Column(db.Integer, nullable=False)
#     number_person = Column(db.Integer, nullable=False)
#     type_room = Column(String(250), nullable=False)
#     price_room = Column(db.Integer, nullable=False)
#     position_room = Column(String(250), nullable=False)
#     status_room = Column(String(250), nullable=False)

In [72]:
room = []
for i in range(1,6):
    room+= [k for k in range(i*100+1, 100*i+30)] + [j for j in range(i*100+60,100*i+90)]

In [73]:
df = pd.DataFrame({'room':room})
df['price_room'] = 670
df['numberDomitory'] = 1
df['type_room'] = 'NORM'
df['number_person'] = df['room'].apply(lambda x: 2 if x%2 else 3)
df['gender'] = df['room'].apply(lambda x: 'MALE' if x%2 else 'FEMALE')
df['empty_position'] =  df['number_person']
df['status_room'] = 'OK'

In [74]:
df.head()

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
0,101,670,1,NORM,2,MALE,2,OK
1,102,670,1,NORM,3,FEMALE,3,OK
2,103,670,1,NORM,2,MALE,2,OK
3,104,670,1,NORM,3,FEMALE,3,OK
4,105,670,1,NORM,2,MALE,2,OK

In [75]:
room = []
for i in range(1,6):
    room+= [k for k in range(1000+ i*100+1, 1000+100*i+30)]

In [76]:
df_block = pd.DataFrame({'room':room})
df_block['price_room'] = 1200
df_block['numberDomitory'] = 1
df_block['type_room'] = 'BLOCK'
df_block['number_person'] = 2
df_block['gender'] = df_block['room'].apply(lambda x: 'MALE' if x%2 else 'FEMALE')
df_block['empty_position'] =  df_block['number_person']
df_block['status_room'] = 'OK'

In [77]:
df_block.head()

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
0,1101,1200,1,BLOCK,2,MALE,2,OK
1,1102,1200,1,BLOCK,2,FEMALE,2,OK
2,1103,1200,1,BLOCK,2,MALE,2,OK
3,1104,1200,1,BLOCK,2,FEMALE,2,OK
4,1105,1200,1,BLOCK,2,MALE,2,OK

In [78]:
df = pd.concat([df, df_block])

In [79]:
df.sample(20)

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
181,405,670,1,NORM,2,MALE,2,OK
274,569,670,1,NORM,2,MALE,2,OK
146,329,670,1,NORM,2,MALE,2,OK
163,376,670,1,NORM,3,FEMALE,3,OK
75,217,670,1,NORM,2,MALE,2,OK
48,179,670,1,NORM,2,MALE,2,OK
80,1323,1200,1,BLOCK,2,MALE,2,OK
196,420,670,1,NORM,3,FEMALE,3,OK
262,527,670,1,NORM,2,MALE,2,OK
166,379,670,1,NORM,2,MALE,2,OK
119,302,670,1,NORM,3,FEMALE,3,OK
265,560,670,1,NORM,3,FEMALE,3,OK
174,387,670,1,NORM,2,MALE,2,OK
242,507,670,1,NORM,2,MALE,2,OK
129,312,670,1,NORM,3,FEMALE,3,OK
245,510,670,1,NORM,3,FEMALE,3,OK
249,514,670,1,NORM,3,FEMALE,3,OK
30,1202,1200,1,BLOCK,2,FEMALE,2,OK
28,1129,1200,1,BLOCK,2,MALE,2,OK
203,427,670,1,NORM,2,MALE,2,OK

In [80]:
df2 = df.copy()
df2['numberDomitory'] = 2
df3 = df.copy()
df3['numberDomitory'] = 3

In [82]:
df = pd.concat([df, df2,df3])

In [84]:
df.sample(20)

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
104,1418,1200,2,BLOCK,2,FEMALE,2,OK
157,370,670,1,NORM,3,FEMALE,3,OK
18,119,670,3,NORM,2,MALE,2,OK
39,1211,1200,2,BLOCK,2,MALE,2,OK
55,186,670,2,NORM,3,FEMALE,3,OK
197,421,670,1,NORM,2,MALE,2,OK
116,1501,1200,3,BLOCK,2,MALE,2,OK
221,475,670,2,NORM,2,MALE,2,OK
215,469,670,1,NORM,2,MALE,2,OK
246,511,670,2,NORM,2,MALE,2,OK
251,516,670,3,NORM,3,FEMALE,3,OK
20,1121,1200,1,BLOCK,2,MALE,2,OK
30,1202,1200,2,BLOCK,2,FEMALE,2,OK
184,408,670,2,NORM,3,FEMALE,3,OK
47,178,670,3,NORM,3,FEMALE,3,OK
51,1223,1200,1,BLOCK,2,MALE,2,OK
31,162,670,3,NORM,3,FEMALE,3,OK
217,471,670,3,NORM,2,MALE,2,OK
54,185,670,3,NORM,2,MALE,2,OK
89,261,670,2,NORM,2,MALE,2,OK

In [83]:
from sqlalchemy import create_engine

disk_engine = create_engine('sqlite:///rooms.sqlite')
df.to_sql(name='rooms', con=disk_engine,if_exists='append',  index=False)